test/request-response-samples/administrate__Complex_json_object_namespace_issue/request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:typens="http://schemas.My.com/My11" xmlns:wsdlns="http://schemas.My.com/My11/wsdl"><SOAP-ENV:Body><typens:Administrate xmlns:typens="http://schemas.My.com/My11" xmlns="http://schemas.My.com/My11"><typens:AdminOperation><typens:CreateUser><typens:User><typens:Name>name</typens:Name><typens:Password>password</typens:Password></typens:User><typens:IgnoreDup></typens:IgnoreDup></typens:CreateUser></typens:AdminOperation></typens:Administrate></SOAP-ENV:Body></SOAP-ENV:Envelope>
